import os

# The root project directory
ROOT_DIR = os.path.dirname(os.path.abspath(__file__))
OSS_PATH = 'http://xiaoheipdf.oss-accelerate.aliyuncs.com/'
CHROME_DRIVER_PATH = os.path.join(ROOT_DIR, 'venv', 'chromedriver')

# The number of occurrences of the company name in a pdf as a keyword
COMPANY_NAME_OCCUR = 3
CUSTOM_KW_OCCUR = 3

# Dictionary storing all the relationship between acronyms and Chinese
translate = {'fxbg': '发现报告',
             'robo': '萝卜投研',
             '36kr': '36kr',
             'woshipm': '我是产品经理'}

tokens = {
    'fxbg': 'eceuwAfKzJ61kNrdyYI3SRA4ldIus77SAn04LbD5O5IKZhceKQ4nk6YGOndKZByw',
    'robo': '43297503256ACFA79996A21A6872D8A0'
}

# Categories, tags and keywords
KW_TO_TAG = {'历史沿革': '历史沿革', '历史事件': '历史沿革', '发展历程': '历史沿革',
             '组织架构': '组织架构',
             '股权架构': '股权架构', '股权变动': '股权架构', '股权结构': '股权架构', '股东': '股权架构', '股权': '股权架构',
             '管理团队': '管理团队', '董事会': '管理团队', '管理人': '管理团队',
             '薪酬体系': '薪酬体系',
             '奖励机制': '奖励机制',
             '业务': '产品', '服务': '产品', '产品': '产品',
             '生产情况': '生产情况', '生产流程': '生产情况', '生产工艺': '生产情况', '产能': '生产情况',
             '销售': '销售情况', '市场需求': {'销售情况', '市场需求'}, '渠道': '销售情况',
             '知识产权': '知识产权', '商标': '知识产权', '专利': '知识产权',
             '核心技术': '核心技术', '核心竞争力': '核心技术', '壁垒': '壁垒',
             '研发': '研发事项', '迭代': '研发事项',
             '客户': '客户', '用户': '客户', '合作': '客户', '伙伴': '客户',
             '对手': '竞争对象', '竞争格局': '竞争对象', '竞争态势': '竞争对象', '头部': '竞争对象', '竞品': '竞争对象',
             '供应': '供应商', '采购': '供应商',
             '市场占有率': '市场占有率', '市场份额': '市场占有率', '市场竞争力': '市场占有率',
             '收入': '运营情况', '营收': '运营情况', '成本': '运营情况', '债务': '运营情况',
             '商业模式': '商业模式', '经营模式': '商业模式', '理念': '商业模式', '业务模型': '商业模式', '盈利模式': '商业模式',
             '增长点': '商业模式', '商业布局': '商业模式',
             '战略': '发展战略', '发展目标': '发展战略', '策略': '发展战略', '规划': '发展战略', '未来': '发展战略', '投资': '发展战略',
             '融资': '发展战略'
             }

# The number indicates the total occurrence of the keywords need to exceed to be considered to own the tag
TAG_TO_KW = {'历史沿革': ({'历史沿革', '历史事件', '发展历程'}, 3),
             '组织架构': ({'组织架构'}, 3),
             '股权架构': ({'股权架构', '股权变动', '股权结构', '股东', '股权'}, 3),
             '管理团队': ({'管理团队', '董事会', '管理人'}, 3),
             '薪酬体系': ({'薪酬体系'}, 3),
             '奖励机制': ({'奖励机制'}, 3),
             '产品': ({'业务', '服务', '产品'}, 3),
             '生产情况': ({'生产情况', '生产流程', '生产工艺', '产能'}, 3),
             '销售情况': ({'销售', '市场需求', '渠道'}, 3),
             '知识产权': ({'知识产权', '商标', '专利'}, 3),
             '核心技术': ({'核心技术', '核心竞争力', '壁垒'}, 3),
             '研发事项': ({'研发', '迭代'}, 3),
             '客户': ({'客户', '用户', '合作', '伙伴'}, 3),
             '市场需求': ({'市场需求'}, 3),
             '竞争对象': ({'对手', '竞争格局', '竞争态势', '头部', '竞品'}, 3),
             '供应商': ({'供应', '采购'}, 3),
             '市场占有率': ({'市场占有率', '市场份额', '市场竞争力'}, 3),
             '运营情况': ({'收入', '营收', '成本', '债务'}, 3),
             '商业模式': ({'商业模式', '经营模式', '理念', '业务模型', '盈利模式', '增长点', '商业布局'}, 3),
             '发展战略': ({'战略', '发展目标', '策略', '规划', '未来', '投资', '融资'}, 3)
             }

CATEGORY_TO_TAG = {
    '企业基本情况': ['历史沿革', '组织架构', '股权架构'],
    '管理团队': ['管理团队', '薪酬体系', '奖励机制'],
    '业务': ['业务', '生产情况', '销售情况', '知识产权', '核心技术', '研发事项', '客户'],
    '市场': ['市场需求', '竞争对象', '供应商', '市场占有率'],
    '商业': ['运营情况', '商业模式', '发展战略']
}

TAG_TO_CATEGORY = {
    '历史沿革': '企业基本情况',
    '组织架构': '企业基本情况',
    '股权架构': '企业基本情况',
    '管理团队': '管理团队',
    '薪酬体系': '管理团队',
    '奖励机制': '管理团队',
    '产品': '业务',
    '生产情况': '业务',
    '销售情况': '业务',
    '知识产权': '业务',
    '核心技术': '业务',
    '壁垒': '业务',
    '研发事项': '业务',
    '客户': '业务',
    '市场需求': '市场',
    '竞争对象': '市场',
    '供应商': '市场',
    '市场占有率': '市场',
    '运营情况': '商业',
    '商业模式': '商业',
    '发展战略': '商业'
}

if __name__ == '__main__':
    print(ROOT_DIR)
